cf_billing/Documents/энргИзменитьНомерПломбыПрибораУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменитьНомерПломбыПрибораУчетаМКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргНомерПломбПриборовУчетаМКД</xr:Item>
				<xr:Item>InformationRegister.УдалитьэнргНомераПломбНаличиеПломбМКД</xr:Item>
				<xr:Item>InformationRegister.УдалитьэнргНомераПломбСостояниеПозицийМКД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановкиПломбы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераПломб</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргМестаУстановкиПломб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбыБыло</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановкиСнятияПломбы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицоУстановившийСнявшийПломбу</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыПломб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргИзменитьНомерПломбыПрибораУчетаМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗаполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;	
	
	ПрефиксФормыДокумента = "энргИзменитьНомерПломбыПрибораУчетаМКД";
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Основание				= Неопределено;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы(ПрефиксФормыДокумента, ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы(ПрефиксФормыДокумента, ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗаполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы(ПрефиксФормыДокумента, ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента", ПрефиксФормыДокумента);
			Параметры.вставить("ВыборОперации", Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаНомерПломбПриборовУчета(Схема, Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", ДокументСсылка);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыТаблицыПодмены(Запрос, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции мкд закрыт'");
	
	Запрос  									= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 								ДокументСсылка);
	Запрос.УстановитьПараметр("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаНомерПломбПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНомерПломбПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	таблицаНомераПломб.МестоУстановки КАК МестоУстановки,
	|	таблицаНомераПломб.НомерПломбы КАК НомерПломбы,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.Состояние КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ КАК Период,
	|		табШапка.Организация КАК Организация,
	|		табШапка.Район КАК Район,
	|		табШапка.МКД КАК МКД,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табШапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		табШапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		ИСТИНА КАК Состояние
	|	ИЗ
	|		Документ.энргИзменитьНомерПломбыПрибораУчетаМКД КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьНомерПломбыПрибораУчетаМКД.ТочкиУчета КАК табТочкиУчета
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ,
	|		табШапка.Организация,
	|		табШапка.Район,
	|		табШапка.МКД,
	|		табТочкиУчета.ПриборУчета,
	|		табШапка.Дата,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ),
	|		табШапка.Ссылка,
	|		табТочкиУчета.IDСтроки,
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.энргИзменитьНомерПломбыПрибораУчетаМКД КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьНомерПломбыПрибораУчетаМКД.ТочкиУчета КАК табТочкиУчета
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьНомерПломбыПрибораУчетаМКД.НомераПломб КАК таблицаНомераПломб
	|		ПО ВложенныйЗапрос.Ссылка = таблицаНомераПломб.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = таблицаНомераПломб.IDСтрокиТочки
	|			И (таблицаНомераПломб.Ссылка В (&мДокументы))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра,ТаблицаИсточник,ТипПараметра,СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема,ПараметрыСостоянияМКД,"СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	| (НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргИзменитьНомерПломбыПрибораУчетаМКД.Ссылка КАК Ссылка,
	|	энргИзменитьНомерПломбыПрибораУчетаМКД.Организация КАК Организация,
	|	энргИзменитьНомерПломбыПрибораУчетаМКД.Район КАК Район,
	|	энргИзменитьНомерПломбыПрибораУчетаМКД.МКД КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргИзменитьНомерПломбыПрибораУчетаМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргИзменитьНомерПломбыПрибораУчетаМКД.ДатаФактическогоСобытия
	|		ИНАЧЕ энргИзменитьНомерПломбыПрибораУчетаМКД.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргИзменитьНомерПломбыПрибораУчетаМКД КАК энргИзменитьНомерПломбыПрибораУчетаМКД
	|ГДЕ
	|	энргИзменитьНомерПломбыПрибораУчетаМКД.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
